Repository: EmanueleAcito89/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/classification_dock.po
Languages: it, uk_ua

source: Classification dock
it: Dock Classificazione
uk_ua: Панель Класифікації (Classification)

source: The Classification dock implements the process of **classification** of the image (or only a preview), with several functions for **vector output**, **accuracy assessment** and **classification reports**.
it: La dock Classificazione permette il processo di **classificazione** dell'immagine (o solamente un'anteprima), con varie funzioni per **l'output vettoriale**, **la verifica di accuratezza** e **i report di classificazione**.
uk_ua: Панель класифікації реалізує процес **класифікації** зображення (або попереднього перегляду її результатів) з додатковими функціями **векторизування результатів**, **оцінки точності** та **звітування про результати класифікації**.

source: The Classification dock allows for the semi-automatic classification of a remote sensing image (or a band set), using the supervised classification algorithms provided by the SAGA GIS (through the Processing plugin).
it: La dock Classificazione permette la classificazione semi-automatica di un'immagine telerilevata (o un set di bande), utilizzando gli algoritmi di classificazione supervisionata forniti da SAGA GIS (attraverso il plugin Processing).
uk_ua: Панель класифікації відповідає за напівавтоматичну класифікацію знімків дистанційного зондування (або набору каналів) з використанням алгоритмів контрольованої класифікації, що надаються ГІС SAGA (через модуль Аналізу).

source: The classification process requires a training shapefile containing the ROIs used for the definition of land cover classes (see the :ref:`roi_dock`). It is possible to use the Macroclass ID or Class ID for classifications.
it: Il processo di classificazione richiede uno shapefile di training contenente le ROI usate per la definizione delle classi di copertura del suolo (vedi la :ref:`roi_dock`). E' possibile usare l'ID Macroclasse o l'ID Classe per la classificazione.
uk_ua: Для реалізації процесу класифікації потрібен навчальний шейп-файл з ROI, що використовуються для визначення класів земного покриву (дивіться :ref:`roi_dock`). Для класифікації можливо застосовувати унікальні ідентифікатори макрокласів (Macroclass ID) або класів (Class ID).

source: The classification can be performed for the entire image, or for a portion of it, creating a classification preview. Similarly to ROI creation, classification previews are created using the preview pointer, and a click on an image pixel; preview classifications are temporarily placed inside a layer group named ``Class_temp_group``, and they are deleted after that the QGIS session is stopped.
it: La classificazione può essere realizzata per l'intera immagine, o per una porzione della stessa, creando un'anteprima di classificazione; le anteprime di classificazione sono posizionate temporaneamente nel gruppo layer chiamato ``Class_temp_group``, e sono eliminate dopo che la sessione di QGIS è terminata.
uk_ua: Класифікація може бути проведена як для всього зображення, так і для його частини з створенням попереднього перегляду результатів. Подібно до створення ROI, попередні перегляди результатів класифікації створюються клацанням вказівником попереднього перегляду на пікселі зображення; попередній перегляд результатів класифікації тимчасово розміщується в групі шарів ``Class_temp_group``, яка видаляється після завершення робочої сесії QGIS.

source: A classification style (i.e. a .qml file) can be used for classifications and previews, allowing for the selection of custom colors for classes.
it: Uno stile di classificazione (cioè un fil .qml) può essere usato per le classificazioni e le anteprime, consentendo la selezione di colori personalizzati per le classi.
uk_ua: Для візуального оформлення результатів класифікації або їх попереднього перегляду може бути використаний стиль класифікації (файл .qml), що дозволяє застосовувати для класів індивідуальні кольори, визначені користувачем.

source: For each classification, a .tif file is created, with a .csv file which contains the spectral statistics of land cover classes.
it: Per ogni classificazione, un file .tif è creato, con un file .csv che contiene le caratteristiche spettrali delle classi di copertura del suolo.
uk_ua: Для кожної класифікації створюється файл .tif разом з файлом .csv, що містить спектральну статистику для класів земного покриву.

source: Also, it is possible to create automatically the vector output of the classification (a shapefile), calculate the classification accuracy, and apply a mask to the land cover classification (using a polygon shapefile).
it: Inoltre, è possibile creare automaticamente l'output vettoriale della classificazione (uno shapefile), calcolare l'accuratezza della classificazione, ed applicare una maschera alla classificazione della copertura del suolo (usando uno shapefile poligonale).
uk_ua: Також є можливість автоматичного векторизування результатів (створення шейп-файлу), розрахунку точності класифікації та застосування маски (у вигляді полігонального шейп-файлу) до класифікації земного покриву.

source: ROI list (Macroclass ID - Class ID - Info)
uk_ua: Перелік ROI (ROI list (Macroclass ID - Class ID - Info))

source: Double click on a ROI item in order to zoom to that ROI in the map.
it: Doppio click su un elemento ROI per effettuare uno zoom su quella ROI nella mappa.
uk_ua: Двічі клацніть на елементі ROI, щоб збільшити до його розміру фрагмент карти.

source: [ ``Select All`` ]: select/unselect all the ROIs;
it: [ ``Seleziona tutto`` ]: seleziona/deseleziona tutte le ROI;
uk_ua: [ ``Select All`` ]: вибрати/скасувати вибір всіх ROI;

source: [ ``Delete selected ROIs`` ]: delete selected ROIs;
it: [ ``Elimina le ROI selezionate`` ]: elimina le ROI selezionate;
uk_ua: [ ``Delete selected ROIs`` ]: видалити вибрані ROI;

source: ``Use Macroclass ID`` : if checked the classification is performed using the Macroclass ID; if unchecked, then the classification is performed using the ID class only.
it: ``Use Macroclass ID`` : se spuntato, la classificazione è realizzata usando l'ID Macroclasse; se non è spuntato, allora la classificazione è realizzata usando solo l'ID classe.
uk_ua: ``Use Macroclass ID`` : якщо опцію увімкнено, то класифікація проводиться на підставі унікальних ідентифікаторів макрокласів (Macroclass ID); якщо опцію вимкнено, класифікація проводиться тільки на підставі унікальних ідентифікаторів класів (Сlass ID).

source: Classification algorithm
it: Algoritmo di classificazione
uk_ua: Алгоритм класифікації (Classification algorithm)

source: ``Select a classification algorithm`` : available classification algorithms are: Maximum Likelihood; Minimum Distance; Spectral Angle Mapping;
it: ``Seleziona un algoritmo di classificazione`` : gli algoritmi disponibili sono: Maximum Likelihood; Minimum Distance; Spectral Angle Mapping;
uk_ua: ``Select a classification algorithm`` : наявні наступні алгоритми класифікації - Максимальної імовірності (Maximum Likelihood), Мінімальної відстані (Minimum Distance), Картографування спектрального кута (Spectral Angle Mapping);

source: ``Threshold`` : if threshold is equal to 0, then all image pixels are classified; otherwise:
it: ``Limite`` : se il limite è pari a 0, allora tutte i pixel dell'immagine sono classificati; altrimenti:
uk_ua: ``Threshold`` : якщо порогова величина дорівнює 0, то всі пікселі зображення класифікуються; в протилежному випадку:

source: for Maximum Likelihood, pixels are unclassified if probability is less than threshold value (max 100);
it: per Maximum Likelihood, i pixel sono non classificati se la probabilità è inferiore al valore limite (max 100);
uk_ua: для Максимальної імовірності пікселі не класифікуються, якщо імовірність менша за значення порогової величини (максимально 100);

source: for Minimum Distance, pixels are unclassified if distance is greater than threshold value;
it: per Minimum Distance, i pixel sono non classificati se la distanza è superiore al valore limite;
uk_ua: для Мінімальної відстані пікселі не класифікуються, якщо відстань більша за значення порогової величини;

source: for Spectral Angle Mapping, pixels are unclassified if spectral angle distance is greater than threshold value (max 90).
it: per Spectral Angle Mapping, i pixel sono non classificati se la distanza dell'angolo spettrale è superiore al valore limite (max 90).
uk_ua: для Картографування спектрального кута пікселі не класифікуються. якщо спектральний кут більший за значення порогової величини (максимально 90).

source: Classification preview
it: Anteprima di classificazione
uk_ua: Попередній перегляд результатів класифікації (Classification preview)

source: [+]: recall the pointer for the creation of a classification preview ;
it: [+]: attiva il puntatore per la creazione di un'anteprima di classificazione;
uk_ua: [+]: викликати вказівник для створення попереднього перегляду результатів класифікації ;

source: ``Size`` : size in pixel unit of a classification preview (i.e. the side lenght of a square, centered at the clicked pixel);
it: ``Dimensione`` : dimensione in pixel dell'anteprima di classificazione (cioè la lunghezza del lato di un quadrato, centrato sul pixel su cui è stato fatto click);
uk_ua: ``Size`` : розмір в пікселях області попереднього перегляду результатів класифікації (тобто довжина сторони квадрата з центром у пікселі, визначеному клацанням);

source: [ ``Redo`` ]: create a new classification preview centered at the same pixel of the previous one.
it: [ ``Rifai`` ]: crea una nuova anteprima di classificazione centrata sullo stesso pixel dell'anteprima precedente.
uk_ua: [ ``Redo`` ]: створити новий попередній перегляд результатів класифікації з центром в тому самому пікселі.

source: Classification style
it: Stile della classificazione
uk_ua: Стиль класифікації (Classification style)

source: [ ``Select qml`` ]: select a previously saved .qml file; this configuration is stored in the QGIS project;
it: [ ``Seleziona qml`` ]: seleziona un file .qml salvato precedentemente; questa configurazione è salvata nel progetto di QGIS;
uk_ua: [ ``Select qml`` ]: вибрати попередньо збережений файл .qml; це налаштування зберігається в проекті QGIS;

source: [ ``Reset`` ]: reset classification and preview styles to default (i.e. colors are automatically assigned to classes).
it: [ ``Reset`` ]: azzera gli stili di classificazione e anteprima al default (cioè i colori sono automaticamente assegnati alle classi).
uk_ua: [ ``Reset`` ]: відновити стилі класифікації та попереднього перегляду до напередзаданих (тобто кольори для класів будуть присвоюватись автоматично).

source: Classification output
it: Output della classificazione
uk_ua: Вихідні результати класифікації (Classification output)

source: ``Create vector`` : if checked, a shapefile classification is saved into the same folder and with the same name defined for the classification output;
it: ``Crea vettoriale`` : se spuntato, uno shapefile della classificazione è salvato nella stessa cartella e con lo stesso nome definito per la classificazione di output;
uk_ua: ``Create vector`` : якщо опцію увімкнено, то шейп-файл класифікації зберігається в той самий каталог та під тим самим іменем, які визначено для вихідних результатів класифікації;

source: ``Apply mask`` : if checked, it allows the users to select a shapefile for the purpose of masking the classification;
it: ``Applica la maschera`` : se spuntato, permette all'utente di selezionare uno shapefile con lo scopo di mascherare la classificazione;
uk_ua: ``Apply mask`` : якщо опцію увімкнено, то користувач може вибрати полігональний шейп-файл для маскування області результатів класифікації;

source: ``Classification report`` : if checked, a report about the land cover classification is calculated, providing the pixel count, the percentage and area for each class; the report is saved as a .csv file in the same folder and with the same name defined for the classification output and the suffix ``_report`` ;
it: ``Classification report`` : se spuntato, un report sulla classificazione della copertura del suolo è calcolato, fornendo il conteggio dei pixel, la percentuale e l'area per ogni classe; il report è salvato come file .csv nella stessa cartella e con lo stesso nome definito per l'output della classificazione ed il suffisso ``_report`` ;
uk_ua: ``Classification report`` : якщо опцію увімкнено, то розраховується звіт про результати класифікації земного покриву, який містить дані про кількість пікселів, частку (%) та площу кожного класу; звіт зберігається як файл .csv з приставкою ``_report`` в той самий каталог та під тим самим іменем, які визначено для вихідних результатів класифікації;

source: ``Calculate accuracy`` : if checked, an error matrix of the classification (using ROIs as ground truth) is saved as a .txt file in the same folder and with the same name defined for the classification output;
it: ``Calcola l'accuratezza`` : se spuntato, una matrice di errore per la classificazione (usando le ROI come verità al suolo) è salvata come file .txt nella stessa cartella e con lo stesso nome definito per l'output della classificazione;
uk_ua: ``Calculate accuracy`` : якщо опцію увімкнено, то матриця похибок (з використанням ROI в якості контрольних даних) зберігається як файл .txt в той самий каталог та під тим самим іменем, які визначено для вихідних результатів класифікації;

source: [ ``Perform classification`` ]: open a window for the selection of output destination, and perform the image classification that is saved as a .tif file, along with the optional outputs.
it: [ ``Esegui la classificazione`` ]: apre una finestra per la selezione della destinazione di output, ed esegue la classificazione dell'immagine che è salvata come file .tif, insieme agli output opzionali.
uk_ua: [ ``Perform classification`` ]: відкриває діалогове вікно для визначення каталогу вихідних результатів, реалізації класифікації з наступним збереженням результатів в файл .tif, а також додаткових вихідних даних.

source: The following is a brief video about the the Classification dock:
it: Il seguente è un breve video sulla dock Classificazione:
uk_ua: Дивіться коротке відео про панель Класифікації:
